# Cable Size Get Cable Size Id By Name Method

Source: https://www.revitapidocs.com/2026/5ecdc480-4d43-8174-bfed-4d4203ea5f67.htm

---

| Cable Size Get Cable Size Id By Name Method |
| --- |

Gets the Cable Size id by given Cable Size name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ElementId GetCableSizeIdByName(
	Document document,
	string name
)
```

```
Public Shared Function GetCableSizeIdByName (
	document As Document,
	name As String
) As ElementId
```

```
public:
static ElementId^ GetCableSizeIdByName(
	Document^ document,
	String^ name
)
```

```
static member GetCableSizeIdByName :
        document : Document *
        name : string -> ElementId
```

#### Parameters

document Document
:   The document.

name String
:   The Cable Size name.

#### Return Value

ElementId
The Cable Size id. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  name cannot include prohibited characters, such as "{, }, \[, ], \|, ;, less\-than sign, greater\-than sign, ?, \`, \~".  \-or\-  name is an empty string. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace